sdaiValidateWhereRuleBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Determines whether the where rule with specified name is satisfied by the specified application instance.
\param instance [in] Identifier of the application instance to be validated.
\param ruleName [in] Name of where rule to check.
\returns sdaiTRUE if where rule is satisfied by application instance; the function returns sdaiFALSE if rule is not satisfied,
or sdaiUNKNOWN if where rule can not be evaluated.